; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-6-2-2-8-8-5) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 depot5)
	(clear crate4)
	(at pallet6 distributor0)
	(clear crate0)
	(at pallet7 distributor1)
	(clear pallet7)
	(at truck0 distributor0)
	(at truck1 depot3)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at crate0 distributor0)
	(on crate0 pallet6)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot0)
	(on crate2 crate1)
	(at crate3 depot1)
	(on crate3 pallet1)
	(at crate4 depot5)
	(on crate4 pallet5)
)

(:goal (and
		(on crate1 pallet0)
		(on crate2 crate3)
		(on crate3 pallet4)
		(on crate4 pallet3)
	)
))

; plan
1. (lift hoist5 crate4 pallet5 depot5)
   deleted: (at crate4 depot5) (available hoist5) (on crate4 pallet5) (clear crate4)
   added: (lifting hoist5 crate4) (clear pallet5)
   goals met: 1 of 4
2. (drive truck0 distributor0 depot5)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot5)
   goals met: 1 of 4
3. (load hoist5 crate4 truck0 depot5)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   goals met: 1 of 4
4. (drive truck0 depot5 depot3)
   deleted: (at truck0 depot5)
   added: (at truck0 depot3)
   goals met: 1 of 4
5. (unload hoist3 crate4 truck0 depot3)
   deleted: (available hoist3) (in crate4 truck0)
   added: (lifting hoist3 crate4)
   goals met: 1 of 4
6. (lift hoist1 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (available hoist1) (on crate3 pallet1) (clear crate3)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 1 of 4
7. (drive truck0 depot3 depot1)
   deleted: (at truck0 depot3)
   added: (at truck0 depot1)
   goals met: 1 of 4
8. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 4
9. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (available hoist0) (on crate2 crate1) (clear crate2)
   added: (lifting hoist0 crate2) (clear crate1)
   goals met: 1 of 4
10. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 4
11. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 1 of 4
12. (drop hoist3 crate4 pallet3 depot3)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (at crate4 depot3) (available hoist3) (on crate4 pallet3) (clear crate4)
   goals met: 2 of 4
13. (drive truck0 depot0 depot4)
   deleted: (at truck0 depot0)
   added: (at truck0 depot4)
   goals met: 2 of 4
14. (unload hoist4 crate3 truck0 depot4)
   deleted: (available hoist4) (in crate3 truck0)
   added: (lifting hoist4 crate3)
   goals met: 2 of 4
15. (drop hoist4 crate3 pallet4 depot4)
   deleted: (lifting hoist4 crate3) (clear pallet4)
   added: (at crate3 depot4) (available hoist4) (on crate3 pallet4) (clear crate3)
   goals met: 3 of 4
16. (unload hoist4 crate2 truck0 depot4)
   deleted: (available hoist4) (in crate2 truck0)
   added: (lifting hoist4 crate2)
   goals met: 3 of 4
17. (drop hoist4 crate2 crate3 depot4)
   deleted: (lifting hoist4 crate2) (clear crate3)
   added: (at crate2 depot4) (available hoist4) (on crate2 crate3) (clear crate2)
   goals met: 4 of 4
